In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df=pd.read_csv("/content/drive/MyDrive/PricingData.csv")

In [ ]:
df.head()

              Seat Fare Type 1  ...        RecordedAt
0                900.00,800.00  ...  11-07-2020 16:28
1  910.00,833.00,795.00,762.00  ...  11-07-2020 19:17
2  910.00,833.00,795.00,762.00  ...  12-07-2020 09:02
3  910.00,833.00,795.00,762.00  ...  12-07-2020 10:05
4  876.00,800.00,767.00,729.00  ...  13-07-2020 01:53

[5 rows x 5 columns]

In [ ]:
df["Seat Fare Type 1"]=df["Seat Fare Type 1"].fillna("0")
df["Seat Fare Type 2"]=df["Seat Fare Type 2"].fillna("0")

In [ ]:
df["Seat Fare Type 1"].isnull().sum()

0

In [ ]:
df["Seat Fare Type 2"].isnull().sum()

0

In [ ]:
d={}
l=[]
for i in df.Bus.unique():
  l.append(i)
for i,j in enumerate(l):
  d[j]=i;

In [ ]:
def f(s):
  return d[s]

In [ ]:
df["Bus"]=df["Bus"].map(f)

In [ ]:
df.head()

              Seat Fare Type 1  ...        RecordedAt
0                900.00,800.00  ...  11-07-2020 16:28
1  910.00,833.00,795.00,762.00  ...  11-07-2020 19:17
2  910.00,833.00,795.00,762.00  ...  12-07-2020 09:02
3  910.00,833.00,795.00,762.00  ...  12-07-2020 10:05
4  876.00,800.00,767.00,729.00  ...  13-07-2020 01:53

[5 rows x 5 columns]

In [ ]:
def f1(s):
  l=s.split(",")
  ans=0
  for i in l:
    # print(float(i))
    ans=ans+float(i)
  # print(ans)
  return ans;

In [ ]:
df["NEW Seat Fare Type 1"]=df["Seat Fare Type 1"].map(f1)

In [ ]:
df["NEW Seat Fare Type 2"]=df["Seat Fare Type 2"].map(f1)

In [ ]:
df["NEW Seat Fare Type"]=df["NEW Seat Fare Type 2"]+df["NEW Seat Fare Type 1"]

In [ ]:
df.head()

              Seat Fare Type 1  ... NEW Seat Fare Type
0                900.00,800.00  ...             1700.0
1  910.00,833.00,795.00,762.00  ...             3300.0
2  910.00,833.00,795.00,762.00  ...             3300.0
3  910.00,833.00,795.00,762.00  ...             3300.0
4  876.00,800.00,767.00,729.00  ...             3172.0

[5 rows x 8 columns]

In [ ]:
d={}
for i in df.Bus.unique():
  d[i]=[]

In [ ]:
for i in df["Service Date"].unique():
  df_temp=df[df["Service Date"]==i]
  df_temp2=df_temp.groupby("Bus")
  for bus,df_t in df_temp2:
    d[bus].append((np.mean(df_t["NEW Seat Fare Type"]),i))

In [ ]:
# d

In [ ]:
d1={}
for i in df['Service Date'].unique():
  d1[i]=[0 for _ in range(len(df.Bus.unique()))]

In [ ]:
j=0
for i in df["Service Date"].unique():
  df_temp=df[df["Service Date"]==i]
  df_temp2=df_temp.groupby("Bus")
  for bus,df_t in df_temp2:
    d1[i][bus]=np.mean(df_t["NEW Seat Fare Type"])#,i))
  
  j=j+1

In [ ]:
d2=pd.DataFrame(d1)

In [ ]:
d2.head()

   15-07-2020 00:00  16-07-2020 00:00  ...  29-07-2020 00:00  30-07-2020 00:00
0          1796.125        764.588235  ...            2142.0       1496.613636
1             0.000          0.000000  ...               0.0          0.000000
2             0.000          0.000000  ...               0.0          0.000000
3             0.000          0.000000  ...               0.0          0.000000
4             0.000          0.000000  ...               0.0          0.000000

[5 rows x 16 columns]

In [ ]:
d2.head(120)

     15-07-2020 00:00  16-07-2020 00:00  ...  29-07-2020 00:00  30-07-2020 00:00
0            1796.125        764.588235  ...       2142.000000       1496.613636
1               0.000          0.000000  ...          0.000000          0.000000
2               0.000          0.000000  ...          0.000000          0.000000
3               0.000          0.000000  ...          0.000000          0.000000
4               0.000          0.000000  ...          0.000000          0.000000
..                ...               ...  ...               ...               ...
112             0.000          0.000000  ...       2034.827586       2024.368421
113             0.000          0.000000  ...          0.000000       1295.815789
114             0.000          0.000000  ...          0.000000        868.760000
115             0.000          0.000000  ...          0.000000        755.625000
116             0.000          0.000000  ...          0.000000       1929.114286

[117 rows x 16 columns]

In [ ]:
d2.to_csv("NEW_DATA.csv",index=False)

In [ ]:
df_temp=df[df["Service Date"]=="15-07-2020 00:00"]

In [ ]:
df_temp

                 Seat Fare Type 1  ... NEW Seat Fare Type
0                   900.00,800.00  ...             1700.0
1     910.00,833.00,795.00,762.00  ...             3300.0
2     910.00,833.00,795.00,762.00  ...             3300.0
3     910.00,833.00,795.00,762.00  ...             3300.0
4     876.00,800.00,767.00,729.00  ...             3172.0
...                           ...  ...                ...
2741               810.00,1200.00  ...             2010.0
2742               810.00,1200.00  ...             2010.0
2743               810.00,1200.00  ...             2010.0
2744               810.00,1200.00  ...             2010.0
2745               810.00,1200.00  ...             2010.0

[2746 rows x 8 columns]

In [ ]:
df_temp2=df_temp.groupby("Bus")

In [ ]:
x=[]
y=[]
for bus,df_t in df_temp2:
  # print(bus)
  x.append(bus)
  y.append(np.mean(df_t["NEW Seat Fare Type"]))
  # print(np.mean(df_t["NEW Seat Fare Type"]))

In [ ]:
%matplotlib inline
import matplotlib.pyplot as plt

In [ ]:
np.corr(y)

AttributeError: ignored